app/controllers/sounds_controller.rb

  def show
    @sound = Sound.find(params[:id])
---
SELECT  "sounds".* FROM "sounds"  WHERE "sounds"."id" = ? LIMIT 1  [["id", 1]]

  def index
    @sounds = Sound.order(sort_column + " " + sort_direction)
---
SELECT "sounds".* FROM "sounds"   ORDER BY length asc

  def create
    @sound = Sound.new(sound_params)
    if @sound.save
---
INSERT INTO "sounds" ("created_at", "format", "length", "name", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    Sound.find(params[:id]).destroy
---
DELETE FROM "sounds" WHERE "sounds"."id" = ?  [["id", 3]]
SELECT  "sounds".* FROM "sounds"  WHERE "sounds"."id" = ? LIMIT 1  [["id", 3]]

  def edit
    @sound = Sound.find(params[:id])
---
SELECT  "sounds".* FROM "sounds"  WHERE "sounds"."id" = ? LIMIT 1  [["id", 16]]

  def update
    @sound = Sound.find(params[:id])
    if @sound.update_attributes(sound_params)
---
SELECT  "sounds".* FROM "sounds"  WHERE "sounds"."id" = ? LIMIT 1  [["id", 16]]
UPDATE "sounds" SET "name" = ?, "updated_at" = ? WHERE "sounds"."id" = 16  [["name", "Test"], ["updated_at", "2014-10-20 21:35:28.442138"]]